; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p5---int100n150-m25---int100c150---s74---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level6 level6)
(sum level0 level10 level10)
(sum level0 level11 level11)
(sum level0 level12 level12)
(sum level0 level14 level14)
(sum level0 level16 level16)
(sum level0 level17 level17)
(sum level0 level25 level25)
(sum level1 level3 level4)
(sum level1 level6 level7)
(sum level1 level10 level11)
(sum level1 level11 level12)
(sum level1 level12 level13)
(sum level1 level14 level15)
(sum level1 level16 level17)
(sum level1 level17 level18)
(sum level1 level25 level26)
(sum level2 level3 level5)
(sum level2 level6 level8)
(sum level2 level10 level12)
(sum level2 level11 level13)
(sum level2 level12 level14)
(sum level2 level14 level16)
(sum level2 level16 level18)
(sum level2 level17 level19)
(sum level2 level25 level27)
(sum level3 level3 level6)
(sum level3 level6 level9)
(sum level3 level10 level13)
(sum level3 level11 level14)
(sum level3 level12 level15)
(sum level3 level14 level17)
(sum level3 level16 level19)
(sum level3 level17 level20)
(sum level3 level25 level28)
(sum level4 level3 level7)
(sum level4 level6 level10)
(sum level4 level10 level14)
(sum level4 level11 level15)
(sum level4 level12 level16)
(sum level4 level14 level18)
(sum level4 level16 level20)
(sum level4 level17 level21)
(sum level4 level25 level29)
(sum level5 level3 level8)
(sum level5 level6 level11)
(sum level5 level10 level15)
(sum level5 level11 level16)
(sum level5 level12 level17)
(sum level5 level14 level19)
(sum level5 level16 level21)
(sum level5 level17 level22)
(sum level5 level25 level30)
(sum level6 level3 level9)
(sum level6 level6 level12)
(sum level6 level10 level16)
(sum level6 level11 level17)
(sum level6 level12 level18)
(sum level6 level14 level20)
(sum level6 level16 level22)
(sum level6 level17 level23)
(sum level6 level25 level31)
(sum level7 level3 level10)
(sum level7 level6 level13)
(sum level7 level10 level17)
(sum level7 level11 level18)
(sum level7 level12 level19)
(sum level7 level14 level21)
(sum level7 level16 level23)
(sum level7 level17 level24)
(sum level7 level25 level32)
(sum level8 level3 level11)
(sum level8 level6 level14)
(sum level8 level10 level18)
(sum level8 level11 level19)
(sum level8 level12 level20)
(sum level8 level14 level22)
(sum level8 level16 level24)
(sum level8 level17 level25)
(sum level8 level25 level33)
(sum level9 level3 level12)
(sum level9 level6 level15)
(sum level9 level10 level19)
(sum level9 level11 level20)
(sum level9 level12 level21)
(sum level9 level14 level23)
(sum level9 level16 level25)
(sum level9 level17 level26)
(sum level9 level25 level34)
(sum level10 level3 level13)
(sum level10 level6 level16)
(sum level10 level10 level20)
(sum level10 level11 level21)
(sum level10 level12 level22)
(sum level10 level14 level24)
(sum level10 level16 level26)
(sum level10 level17 level27)
(sum level10 level25 level35)
(sum level11 level3 level14)
(sum level11 level6 level17)
(sum level11 level10 level21)
(sum level11 level11 level22)
(sum level11 level12 level23)
(sum level11 level14 level25)
(sum level11 level16 level27)
(sum level11 level17 level28)
(sum level11 level25 level36)
(sum level12 level3 level15)
(sum level12 level6 level18)
(sum level12 level10 level22)
(sum level12 level11 level23)
(sum level12 level12 level24)
(sum level12 level14 level26)
(sum level12 level16 level28)
(sum level12 level17 level29)
(sum level12 level25 level37)
(sum level13 level3 level16)
(sum level13 level6 level19)
(sum level13 level10 level23)
(sum level13 level11 level24)
(sum level13 level12 level25)
(sum level13 level14 level27)
(sum level13 level16 level29)
(sum level13 level17 level30)
(sum level13 level25 level38)
(sum level14 level3 level17)
(sum level14 level6 level20)
(sum level14 level10 level24)
(sum level14 level11 level25)
(sum level14 level12 level26)
(sum level14 level14 level28)
(sum level14 level16 level30)
(sum level14 level17 level31)
(sum level14 level25 level39)
(sum level15 level3 level18)
(sum level15 level6 level21)
(sum level15 level10 level25)
(sum level15 level11 level26)
(sum level15 level12 level27)
(sum level15 level14 level29)
(sum level15 level16 level31)
(sum level15 level17 level32)
(sum level15 level25 level40)
(sum level16 level3 level19)
(sum level16 level6 level22)
(sum level16 level10 level26)
(sum level16 level11 level27)
(sum level16 level12 level28)
(sum level16 level14 level30)
(sum level16 level16 level32)
(sum level16 level17 level33)
(sum level16 level25 level41)
(sum level17 level3 level20)
(sum level17 level6 level23)
(sum level17 level10 level27)
(sum level17 level11 level28)
(sum level17 level12 level29)
(sum level17 level14 level31)
(sum level17 level16 level33)
(sum level17 level17 level34)
(sum level17 level25 level42)
(sum level18 level3 level21)
(sum level18 level6 level24)
(sum level18 level10 level28)
(sum level18 level11 level29)
(sum level18 level12 level30)
(sum level18 level14 level32)
(sum level18 level16 level34)
(sum level18 level17 level35)
(sum level18 level25 level43)
(sum level19 level3 level22)
(sum level19 level6 level25)
(sum level19 level10 level29)
(sum level19 level11 level30)
(sum level19 level12 level31)
(sum level19 level14 level33)
(sum level19 level16 level35)
(sum level19 level17 level36)
(sum level19 level25 level44)
(sum level20 level3 level23)
(sum level20 level6 level26)
(sum level20 level10 level30)
(sum level20 level11 level31)
(sum level20 level12 level32)
(sum level20 level14 level34)
(sum level20 level16 level36)
(sum level20 level17 level37)
(sum level20 level25 level45)
(sum level21 level3 level24)
(sum level21 level6 level27)
(sum level21 level10 level31)
(sum level21 level11 level32)
(sum level21 level12 level33)
(sum level21 level14 level35)
(sum level21 level16 level37)
(sum level21 level17 level38)
(sum level21 level25 level46)
(sum level22 level3 level25)
(sum level22 level6 level28)
(sum level22 level10 level32)
(sum level22 level11 level33)
(sum level22 level12 level34)
(sum level22 level14 level36)
(sum level22 level16 level38)
(sum level22 level17 level39)
(sum level22 level25 level47)
(sum level23 level3 level26)
(sum level23 level6 level29)
(sum level23 level10 level33)
(sum level23 level11 level34)
(sum level23 level12 level35)
(sum level23 level14 level37)
(sum level23 level16 level39)
(sum level23 level17 level40)
(sum level23 level25 level48)
(sum level24 level3 level27)
(sum level24 level6 level30)
(sum level24 level10 level34)
(sum level24 level11 level35)
(sum level24 level12 level36)
(sum level24 level14 level38)
(sum level24 level16 level40)
(sum level24 level17 level41)
(sum level24 level25 level49)
(sum level25 level3 level28)
(sum level25 level6 level31)
(sum level25 level10 level35)
(sum level25 level11 level36)
(sum level25 level12 level37)
(sum level25 level14 level39)
(sum level25 level16 level41)
(sum level25 level17 level42)
(sum level25 level25 level50)
(sum level26 level3 level29)
(sum level26 level6 level32)
(sum level26 level10 level36)
(sum level26 level11 level37)
(sum level26 level12 level38)
(sum level26 level14 level40)
(sum level26 level16 level42)
(sum level26 level17 level43)
(sum level26 level25 level51)
(sum level27 level3 level30)
(sum level27 level6 level33)
(sum level27 level10 level37)
(sum level27 level11 level38)
(sum level27 level12 level39)
(sum level27 level14 level41)
(sum level27 level16 level43)
(sum level27 level17 level44)
(sum level27 level25 level52)
(sum level28 level3 level31)
(sum level28 level6 level34)
(sum level28 level10 level38)
(sum level28 level11 level39)
(sum level28 level12 level40)
(sum level28 level14 level42)
(sum level28 level16 level44)
(sum level28 level17 level45)
(sum level28 level25 level53)
(sum level29 level3 level32)
(sum level29 level6 level35)
(sum level29 level10 level39)
(sum level29 level11 level40)
(sum level29 level12 level41)
(sum level29 level14 level43)
(sum level29 level16 level45)
(sum level29 level17 level46)
(sum level29 level25 level54)
(sum level30 level3 level33)
(sum level30 level6 level36)
(sum level30 level10 level40)
(sum level30 level11 level41)
(sum level30 level12 level42)
(sum level30 level14 level44)
(sum level30 level16 level46)
(sum level30 level17 level47)
(sum level30 level25 level55)
(sum level31 level3 level34)
(sum level31 level6 level37)
(sum level31 level10 level41)
(sum level31 level11 level42)
(sum level31 level12 level43)
(sum level31 level14 level45)
(sum level31 level16 level47)
(sum level31 level17 level48)
(sum level31 level25 level56)
(sum level32 level3 level35)
(sum level32 level6 level38)
(sum level32 level10 level42)
(sum level32 level11 level43)
(sum level32 level12 level44)
(sum level32 level14 level46)
(sum level32 level16 level48)
(sum level32 level17 level49)
(sum level32 level25 level57)
(sum level33 level3 level36)
(sum level33 level6 level39)
(sum level33 level10 level43)
(sum level33 level11 level44)
(sum level33 level12 level45)
(sum level33 level14 level47)
(sum level33 level16 level49)
(sum level33 level17 level50)
(sum level33 level25 level58)
(sum level34 level3 level37)
(sum level34 level6 level40)
(sum level34 level10 level44)
(sum level34 level11 level45)
(sum level34 level12 level46)
(sum level34 level14 level48)
(sum level34 level16 level50)
(sum level34 level17 level51)
(sum level34 level25 level59)
(sum level35 level3 level38)
(sum level35 level6 level41)
(sum level35 level10 level45)
(sum level35 level11 level46)
(sum level35 level12 level47)
(sum level35 level14 level49)
(sum level35 level16 level51)
(sum level35 level17 level52)
(sum level35 level25 level60)
(sum level36 level3 level39)
(sum level36 level6 level42)
(sum level36 level10 level46)
(sum level36 level11 level47)
(sum level36 level12 level48)
(sum level36 level14 level50)
(sum level36 level16 level52)
(sum level36 level17 level53)
(sum level36 level25 level61)
(sum level37 level3 level40)
(sum level37 level6 level43)
(sum level37 level10 level47)
(sum level37 level11 level48)
(sum level37 level12 level49)
(sum level37 level14 level51)
(sum level37 level16 level53)
(sum level37 level17 level54)
(sum level37 level25 level62)
(sum level38 level3 level41)
(sum level38 level6 level44)
(sum level38 level10 level48)
(sum level38 level11 level49)
(sum level38 level12 level50)
(sum level38 level14 level52)
(sum level38 level16 level54)
(sum level38 level17 level55)
(sum level38 level25 level63)
(sum level39 level3 level42)
(sum level39 level6 level45)
(sum level39 level10 level49)
(sum level39 level11 level50)
(sum level39 level12 level51)
(sum level39 level14 level53)
(sum level39 level16 level55)
(sum level39 level17 level56)
(sum level39 level25 level64)
(sum level40 level3 level43)
(sum level40 level6 level46)
(sum level40 level10 level50)
(sum level40 level11 level51)
(sum level40 level12 level52)
(sum level40 level14 level54)
(sum level40 level16 level56)
(sum level40 level17 level57)
(sum level40 level25 level65)
(sum level41 level3 level44)
(sum level41 level6 level47)
(sum level41 level10 level51)
(sum level41 level11 level52)
(sum level41 level12 level53)
(sum level41 level14 level55)
(sum level41 level16 level57)
(sum level41 level17 level58)
(sum level41 level25 level66)
(sum level42 level3 level45)
(sum level42 level6 level48)
(sum level42 level10 level52)
(sum level42 level11 level53)
(sum level42 level12 level54)
(sum level42 level14 level56)
(sum level42 level16 level58)
(sum level42 level17 level59)
(sum level42 level25 level67)
(sum level43 level3 level46)
(sum level43 level6 level49)
(sum level43 level10 level53)
(sum level43 level11 level54)
(sum level43 level12 level55)
(sum level43 level14 level57)
(sum level43 level16 level59)
(sum level43 level17 level60)
(sum level43 level25 level68)
(sum level44 level3 level47)
(sum level44 level6 level50)
(sum level44 level10 level54)
(sum level44 level11 level55)
(sum level44 level12 level56)
(sum level44 level14 level58)
(sum level44 level16 level60)
(sum level44 level17 level61)
(sum level44 level25 level69)
(sum level45 level3 level48)
(sum level45 level6 level51)
(sum level45 level10 level55)
(sum level45 level11 level56)
(sum level45 level12 level57)
(sum level45 level14 level59)
(sum level45 level16 level61)
(sum level45 level17 level62)
(sum level45 level25 level70)
(sum level46 level3 level49)
(sum level46 level6 level52)
(sum level46 level10 level56)
(sum level46 level11 level57)
(sum level46 level12 level58)
(sum level46 level14 level60)
(sum level46 level16 level62)
(sum level46 level17 level63)
(sum level46 level25 level71)
(sum level47 level3 level50)
(sum level47 level6 level53)
(sum level47 level10 level57)
(sum level47 level11 level58)
(sum level47 level12 level59)
(sum level47 level14 level61)
(sum level47 level16 level63)
(sum level47 level17 level64)
(sum level47 level25 level72)
(sum level48 level3 level51)
(sum level48 level6 level54)
(sum level48 level10 level58)
(sum level48 level11 level59)
(sum level48 level12 level60)
(sum level48 level14 level62)
(sum level48 level16 level64)
(sum level48 level17 level65)
(sum level48 level25 level73)
(sum level49 level3 level52)
(sum level49 level6 level55)
(sum level49 level10 level59)
(sum level49 level11 level60)
(sum level49 level12 level61)
(sum level49 level14 level63)
(sum level49 level16 level65)
(sum level49 level17 level66)
(sum level49 level25 level74)
(sum level50 level3 level53)
(sum level50 level6 level56)
(sum level50 level10 level60)
(sum level50 level11 level61)
(sum level50 level12 level62)
(sum level50 level14 level64)
(sum level50 level16 level66)
(sum level50 level17 level67)
(sum level50 level25 level75)
(sum level51 level3 level54)
(sum level51 level6 level57)
(sum level51 level10 level61)
(sum level51 level11 level62)
(sum level51 level12 level63)
(sum level51 level14 level65)
(sum level51 level16 level67)
(sum level51 level17 level68)
(sum level51 level25 level76)
(sum level52 level3 level55)
(sum level52 level6 level58)
(sum level52 level10 level62)
(sum level52 level11 level63)
(sum level52 level12 level64)
(sum level52 level14 level66)
(sum level52 level16 level68)
(sum level52 level17 level69)
(sum level52 level25 level77)
(sum level53 level3 level56)
(sum level53 level6 level59)
(sum level53 level10 level63)
(sum level53 level11 level64)
(sum level53 level12 level65)
(sum level53 level14 level67)
(sum level53 level16 level69)
(sum level53 level17 level70)
(sum level53 level25 level78)
(sum level54 level3 level57)
(sum level54 level6 level60)
(sum level54 level10 level64)
(sum level54 level11 level65)
(sum level54 level12 level66)
(sum level54 level14 level68)
(sum level54 level16 level70)
(sum level54 level17 level71)
(sum level54 level25 level79)
(sum level55 level3 level58)
(sum level55 level6 level61)
(sum level55 level10 level65)
(sum level55 level11 level66)
(sum level55 level12 level67)
(sum level55 level14 level69)
(sum level55 level16 level71)
(sum level55 level17 level72)
(sum level55 level25 level80)
(sum level56 level3 level59)
(sum level56 level6 level62)
(sum level56 level10 level66)
(sum level56 level11 level67)
(sum level56 level12 level68)
(sum level56 level14 level70)
(sum level56 level16 level72)
(sum level56 level17 level73)
(sum level56 level25 level81)
(sum level57 level3 level60)
(sum level57 level6 level63)
(sum level57 level10 level67)
(sum level57 level11 level68)
(sum level57 level12 level69)
(sum level57 level14 level71)
(sum level57 level16 level73)
(sum level57 level17 level74)
(sum level57 level25 level82)
(sum level58 level3 level61)
(sum level58 level6 level64)
(sum level58 level10 level68)
(sum level58 level11 level69)
(sum level58 level12 level70)
(sum level58 level14 level72)
(sum level58 level16 level74)
(sum level58 level17 level75)
(sum level58 level25 level83)
(sum level59 level3 level62)
(sum level59 level6 level65)
(sum level59 level10 level69)
(sum level59 level11 level70)
(sum level59 level12 level71)
(sum level59 level14 level73)
(sum level59 level16 level75)
(sum level59 level17 level76)
(sum level59 level25 level84)
(sum level60 level3 level63)
(sum level60 level6 level66)
(sum level60 level10 level70)
(sum level60 level11 level71)
(sum level60 level12 level72)
(sum level60 level14 level74)
(sum level60 level16 level76)
(sum level60 level17 level77)
(sum level60 level25 level85)
(sum level61 level3 level64)
(sum level61 level6 level67)
(sum level61 level10 level71)
(sum level61 level11 level72)
(sum level61 level12 level73)
(sum level61 level14 level75)
(sum level61 level16 level77)
(sum level61 level17 level78)
(sum level61 level25 level86)
(sum level62 level3 level65)
(sum level62 level6 level68)
(sum level62 level10 level72)
(sum level62 level11 level73)
(sum level62 level12 level74)
(sum level62 level14 level76)
(sum level62 level16 level78)
(sum level62 level17 level79)
(sum level62 level25 level87)
(sum level63 level3 level66)
(sum level63 level6 level69)
(sum level63 level10 level73)
(sum level63 level11 level74)
(sum level63 level12 level75)
(sum level63 level14 level77)
(sum level63 level16 level79)
(sum level63 level17 level80)
(sum level63 level25 level88)
(sum level64 level3 level67)
(sum level64 level6 level70)
(sum level64 level10 level74)
(sum level64 level11 level75)
(sum level64 level12 level76)
(sum level64 level14 level78)
(sum level64 level16 level80)
(sum level64 level17 level81)
(sum level64 level25 level89)
(sum level65 level3 level68)
(sum level65 level6 level71)
(sum level65 level10 level75)
(sum level65 level11 level76)
(sum level65 level12 level77)
(sum level65 level14 level79)
(sum level65 level16 level81)
(sum level65 level17 level82)
(sum level65 level25 level90)
(sum level66 level3 level69)
(sum level66 level6 level72)
(sum level66 level10 level76)
(sum level66 level11 level77)
(sum level66 level12 level78)
(sum level66 level14 level80)
(sum level66 level16 level82)
(sum level66 level17 level83)
(sum level66 level25 level91)
(sum level67 level3 level70)
(sum level67 level6 level73)
(sum level67 level10 level77)
(sum level67 level11 level78)
(sum level67 level12 level79)
(sum level67 level14 level81)
(sum level67 level16 level83)
(sum level67 level17 level84)
(sum level67 level25 level92)
(sum level68 level3 level71)
(sum level68 level6 level74)
(sum level68 level10 level78)
(sum level68 level11 level79)
(sum level68 level12 level80)
(sum level68 level14 level82)
(sum level68 level16 level84)
(sum level68 level17 level85)
(sum level68 level25 level93)
(sum level69 level3 level72)
(sum level69 level6 level75)
(sum level69 level10 level79)
(sum level69 level11 level80)
(sum level69 level12 level81)
(sum level69 level14 level83)
(sum level69 level16 level85)
(sum level69 level17 level86)
(sum level69 level25 level94)
(sum level70 level3 level73)
(sum level70 level6 level76)
(sum level70 level10 level80)
(sum level70 level11 level81)
(sum level70 level12 level82)
(sum level70 level14 level84)
(sum level70 level16 level86)
(sum level70 level17 level87)
(sum level70 level25 level95)
(sum level71 level3 level74)
(sum level71 level6 level77)
(sum level71 level10 level81)
(sum level71 level11 level82)
(sum level71 level12 level83)
(sum level71 level14 level85)
(sum level71 level16 level87)
(sum level71 level17 level88)
(sum level71 level25 level96)
(sum level72 level3 level75)
(sum level72 level6 level78)
(sum level72 level10 level82)
(sum level72 level11 level83)
(sum level72 level12 level84)
(sum level72 level14 level86)
(sum level72 level16 level88)
(sum level72 level17 level89)
(sum level72 level25 level97)
(sum level73 level3 level76)
(sum level73 level6 level79)
(sum level73 level10 level83)
(sum level73 level11 level84)
(sum level73 level12 level85)
(sum level73 level14 level87)
(sum level73 level16 level89)
(sum level73 level17 level90)
(sum level73 level25 level98)
(sum level74 level3 level77)
(sum level74 level6 level80)
(sum level74 level10 level84)
(sum level74 level11 level85)
(sum level74 level12 level86)
(sum level74 level14 level88)
(sum level74 level16 level90)
(sum level74 level17 level91)
(sum level74 level25 level99)
(sum level75 level3 level78)
(sum level75 level6 level81)
(sum level75 level10 level85)
(sum level75 level11 level86)
(sum level75 level12 level87)
(sum level75 level14 level89)
(sum level75 level16 level91)
(sum level75 level17 level92)
(sum level75 level25 level100)
(sum level76 level3 level79)
(sum level76 level6 level82)
(sum level76 level10 level86)
(sum level76 level11 level87)
(sum level76 level12 level88)
(sum level76 level14 level90)
(sum level76 level16 level92)
(sum level76 level17 level93)
(sum level76 level25 level101)
(sum level77 level3 level80)
(sum level77 level6 level83)
(sum level77 level10 level87)
(sum level77 level11 level88)
(sum level77 level12 level89)
(sum level77 level14 level91)
(sum level77 level16 level93)
(sum level77 level17 level94)
(sum level77 level25 level102)
(sum level78 level3 level81)
(sum level78 level6 level84)
(sum level78 level10 level88)
(sum level78 level11 level89)
(sum level78 level12 level90)
(sum level78 level14 level92)
(sum level78 level16 level94)
(sum level78 level17 level95)
(sum level78 level25 level103)
(sum level79 level3 level82)
(sum level79 level6 level85)
(sum level79 level10 level89)
(sum level79 level11 level90)
(sum level79 level12 level91)
(sum level79 level14 level93)
(sum level79 level16 level95)
(sum level79 level17 level96)
(sum level79 level25 level104)
(sum level80 level3 level83)
(sum level80 level6 level86)
(sum level80 level10 level90)
(sum level80 level11 level91)
(sum level80 level12 level92)
(sum level80 level14 level94)
(sum level80 level16 level96)
(sum level80 level17 level97)
(sum level80 level25 level105)
(sum level81 level3 level84)
(sum level81 level6 level87)
(sum level81 level10 level91)
(sum level81 level11 level92)
(sum level81 level12 level93)
(sum level81 level14 level95)
(sum level81 level16 level97)
(sum level81 level17 level98)
(sum level81 level25 level106)
(sum level82 level3 level85)
(sum level82 level6 level88)
(sum level82 level10 level92)
(sum level82 level11 level93)
(sum level82 level12 level94)
(sum level82 level14 level96)
(sum level82 level16 level98)
(sum level82 level17 level99)
(sum level82 level25 level107)
(sum level83 level3 level86)
(sum level83 level6 level89)
(sum level83 level10 level93)
(sum level83 level11 level94)
(sum level83 level12 level95)
(sum level83 level14 level97)
(sum level83 level16 level99)
(sum level83 level17 level100)
(sum level83 level25 level108)
(sum level84 level3 level87)
(sum level84 level6 level90)
(sum level84 level10 level94)
(sum level84 level11 level95)
(sum level84 level12 level96)
(sum level84 level14 level98)
(sum level84 level16 level100)
(sum level84 level17 level101)
(sum level84 level25 level109)
(sum level85 level3 level88)
(sum level85 level6 level91)
(sum level85 level10 level95)
(sum level85 level11 level96)
(sum level85 level12 level97)
(sum level85 level14 level99)
(sum level85 level16 level101)
(sum level85 level17 level102)
(sum level85 level25 level110)
(sum level86 level3 level89)
(sum level86 level6 level92)
(sum level86 level10 level96)
(sum level86 level11 level97)
(sum level86 level12 level98)
(sum level86 level14 level100)
(sum level86 level16 level102)
(sum level86 level17 level103)
(sum level86 level25 level111)
(sum level87 level3 level90)
(sum level87 level6 level93)
(sum level87 level10 level97)
(sum level87 level11 level98)
(sum level87 level12 level99)
(sum level87 level14 level101)
(sum level87 level16 level103)
(sum level87 level17 level104)
(sum level87 level25 level112)
(sum level88 level3 level91)
(sum level88 level6 level94)
(sum level88 level10 level98)
(sum level88 level11 level99)
(sum level88 level12 level100)
(sum level88 level14 level102)
(sum level88 level16 level104)
(sum level88 level17 level105)
(sum level88 level25 level113)
(sum level89 level3 level92)
(sum level89 level6 level95)
(sum level89 level10 level99)
(sum level89 level11 level100)
(sum level89 level12 level101)
(sum level89 level14 level103)
(sum level89 level16 level105)
(sum level89 level17 level106)
(sum level89 level25 level114)
(sum level90 level3 level93)
(sum level90 level6 level96)
(sum level90 level10 level100)
(sum level90 level11 level101)
(sum level90 level12 level102)
(sum level90 level14 level104)
(sum level90 level16 level106)
(sum level90 level17 level107)
(sum level91 level3 level94)
(sum level91 level6 level97)
(sum level91 level10 level101)
(sum level91 level11 level102)
(sum level91 level12 level103)
(sum level91 level14 level105)
(sum level91 level16 level107)
(sum level91 level17 level108)
(sum level92 level3 level95)
(sum level92 level6 level98)
(sum level92 level10 level102)
(sum level92 level11 level103)
(sum level92 level12 level104)
(sum level92 level14 level106)
(sum level92 level16 level108)
(sum level92 level17 level109)
(sum level93 level3 level96)
(sum level93 level6 level99)
(sum level93 level10 level103)
(sum level93 level11 level104)
(sum level93 level12 level105)
(sum level93 level14 level107)
(sum level93 level16 level109)
(sum level93 level17 level110)
(sum level94 level3 level97)
(sum level94 level6 level100)
(sum level94 level10 level104)
(sum level94 level11 level105)
(sum level94 level12 level106)
(sum level94 level14 level108)
(sum level94 level16 level110)
(sum level94 level17 level111)
(sum level95 level3 level98)
(sum level95 level6 level101)
(sum level95 level10 level105)
(sum level95 level11 level106)
(sum level95 level12 level107)
(sum level95 level14 level109)
(sum level95 level16 level111)
(sum level95 level17 level112)
(sum level96 level3 level99)
(sum level96 level6 level102)
(sum level96 level10 level106)
(sum level96 level11 level107)
(sum level96 level12 level108)
(sum level96 level14 level110)
(sum level96 level16 level112)
(sum level96 level17 level113)
(sum level97 level3 level100)
(sum level97 level6 level103)
(sum level97 level10 level107)
(sum level97 level11 level108)
(sum level97 level12 level109)
(sum level97 level14 level111)
(sum level97 level16 level113)
(sum level97 level17 level114)
(sum level98 level3 level101)
(sum level98 level6 level104)
(sum level98 level10 level108)
(sum level98 level11 level109)
(sum level98 level12 level110)
(sum level98 level14 level112)
(sum level98 level16 level114)
(sum level99 level3 level102)
(sum level99 level6 level105)
(sum level99 level10 level109)
(sum level99 level11 level110)
(sum level99 level12 level111)
(sum level99 level14 level113)
(sum level100 level3 level103)
(sum level100 level6 level106)
(sum level100 level10 level110)
(sum level100 level11 level111)
(sum level100 level12 level112)
(sum level100 level14 level114)
(sum level101 level3 level104)
(sum level101 level6 level107)
(sum level101 level10 level111)
(sum level101 level11 level112)
(sum level101 level12 level113)
(sum level102 level3 level105)
(sum level102 level6 level108)
(sum level102 level10 level112)
(sum level102 level11 level113)
(sum level102 level12 level114)
(sum level103 level3 level106)
(sum level103 level6 level109)
(sum level103 level10 level113)
(sum level103 level11 level114)
(sum level104 level3 level107)
(sum level104 level6 level110)
(sum level104 level10 level114)
(sum level105 level3 level108)
(sum level105 level6 level111)
(sum level106 level3 level109)
(sum level106 level6 level112)
(sum level107 level3 level110)
(sum level107 level6 level113)
(sum level108 level3 level111)
(sum level108 level6 level114)
(sum level109 level3 level112)
(sum level110 level3 level113)
(sum level111 level3 level114)

(connected l0 l1)
(fuelcost level3 l0 l1)
(connected l0 l2)
(fuelcost level17 l0 l2)
(connected l0 l3)
(fuelcost level16 l0 l3)
(connected l0 l4)
(fuelcost level11 l0 l4)
(connected l0 l5)
(fuelcost level12 l0 l5)
(connected l1 l0)
(fuelcost level3 l1 l0)
(connected l1 l2)
(fuelcost level14 l1 l2)
(connected l2 l0)
(fuelcost level17 l2 l0)
(connected l2 l1)
(fuelcost level14 l2 l1)
(connected l2 l3)
(fuelcost level25 l2 l3)
(connected l2 l4)
(fuelcost level10 l2 l4)
(connected l3 l0)
(fuelcost level16 l3 l0)
(connected l3 l2)
(fuelcost level25 l3 l2)
(connected l4 l0)
(fuelcost level11 l4 l0)
(connected l4 l2)
(fuelcost level10 l4 l2)
(connected l4 l5)
(fuelcost level6 l4 l5)
(connected l5 l0)
(fuelcost level12 l5 l0)
(connected l5 l4)
(fuelcost level6 l5 l4)

(at t0 l4)
(fuel t0 level114)
(= (total-cost) 0)

(at p0 l4)
(at p1 l1)
(at p2 l3)
(at p3 l5)
(at p4 l2)
)

(:goal
(and
(at p0 l1)
(at p1 l2)
(at p2 l0)
(at p3 l2)
(at p4 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p0 t0 l4)
   deleted: (at p0 l4)
   added: (in p0 t0)
   goals met: 0 of 5
2. (drive t0 l4 l5 level108 level6 level114)
   deleted: (at t0 l4) (fuel t0 level114)
   added: (at t0 l5) (fuel t0 level108)
   goals met: 0 of 5
3. (load p3 t0 l5)
   deleted: (at p3 l5)
   added: (in p3 t0)
   goals met: 0 of 5
4. (drive t0 l5 l0 level96 level12 level108)
   deleted: (at t0 l5) (fuel t0 level108)
   added: (at t0 l0) (fuel t0 level96)
   goals met: 0 of 5
5. (drive t0 l0 l1 level93 level3 level96)
   deleted: (at t0 l0) (fuel t0 level96)
   added: (at t0 l1) (fuel t0 level93)
   goals met: 0 of 5
6. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 1 of 5
7. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 1 of 5
8. (drive t0 l1 l2 level79 level14 level93)
   deleted: (at t0 l1) (fuel t0 level93)
   added: (at t0 l2) (fuel t0 level79)
   goals met: 1 of 5
9. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 1 of 5
10. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 2 of 5
11. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 3 of 5
12. (drive t0 l2 l3 level54 level25 level79)
   deleted: (at t0 l2) (fuel t0 level79)
   added: (at t0 l3) (fuel t0 level54)
   goals met: 3 of 5
13. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 3 of 5
14. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 4 of 5
15. (drive t0 l3 l0 level38 level16 level54)
   deleted: (at t0 l3) (fuel t0 level54)
   added: (at t0 l0) (fuel t0 level38)
   goals met: 4 of 5
16. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 5 of 5
